In [1]:
import pandas as pd

In [3]:
data1 = [['tom', 10, 1], ['nick', 15, 1], ['juli', 14, 1]]
 
# Create the pandas DataFrame
df1 = pd.DataFrame(data1, columns = ['Name', 'Age', 'one'])
 
# print dataframe.
df1

   Name  Age  one
0   tom   10    1
1  nick   15    1
2  juli   14    1

In [8]:
data2 = [['tom2', 120, 1], ['nick2', 125, 1], ['juli2', 124, 1]]
 
# Create the pandas DataFrame
df2 = pd.DataFrame(data2, columns = ['Name', 'Age', 'one'])
 
# print dataframe.
df2

    Name  Age  one
0   tom2  120    1
1  nick2  125    1
2  juli2  124    1

In [9]:
pd.merge(df1, df2, on='one')

  Name_x  Age_x  one Name_y  Age_y
0    tom     10    1   tom2    120
1    tom     10    1  nick2    125
2    tom     10    1  juli2    124
3   nick     15    1   tom2    120
4   nick     15    1  nick2    125
5   nick     15    1  juli2    124
6   juli     14    1   tom2    120
7   juli     14    1  nick2    125
8   juli     14    1  juli2    124

In [25]:
df1.set_index('University')
df1

                    University  Undergrads  Tuition
0       University of Virginia       16777    14188
1                Virginia Tech       26623    13691
2      George Mason University       26013    10370
3  College of William and Mary        6377    13127

In [24]:
df2.set_index('University')
df2

                                    University  Gradstudents  Faculty
0                       University of Virginia          7862     3265
1                                Virginia Tech          6780     1395
2  University of North Carolina at Chapel Hill         10894     3696
3                       University of Maryland         10438     4610

In [22]:
df3

                                    University  Undergrads  Established
0                       University of Maryland       30762         1856
1  University of North Carolina at Chapel Hill       30011         1789
2                              Duke University        6994         1838
3              North Carolina State University       35479         1887

In [32]:
#August 20, 1977
[pd.to_datetime('1977-08-20 13:25:43')]

[Timestamp('1977-08-20 13:25:43')]

In [41]:
df = pd.DataFrame({'time': [pd.to_datetime('1977-08-20')]})
df

        time
0 1977-08-20

In [40]:
# November 5, 2018 
df['time'] = [pd.to_datetime('2018-11-5')]
df

        time
0 2018-11-05

In [44]:
t1 = pd.to_datetime('8/20/1977 00:00')
t2 = pd.to_datetime('11/5/2018 00:00')

print(pd.Timedelta(t2 - t1))

15052 days 00:00:00

In [53]:
12+14

26

In [60]:
(pd.date_range('2021-01-01', '2021-12-31', freq='WOM-2WED'))

DatetimeIndex(['2021-01-13', '2021-02-10', '2021-03-10', '2021-04-14',
               '2021-05-12', '2021-06-09', '2021-07-14', '2021-08-11',
               '2021-09-08', '2021-10-13', '2021-11-10', '2021-12-08'],
              dtype='datetime64[ns]', freq='WOM-2WED')

In [59]:
pd.date_range('2021-01-13', periods=12, freq='30d')

DatetimeIndex(['2021-01-13', '2021-02-12', '2021-03-14', '2021-04-13',
               '2021-05-13', '2021-06-12', '2021-07-12', '2021-08-11',
               '2021-09-10', '2021-10-10', '2021-11-09', '2021-12-09'],
              dtype='datetime64[ns]', freq='30D')

In [56]:
pd.date_range('2022-01-01', '2022-12-31', freq='W-WED')

DatetimeIndex(['2022-01-05', '2022-01-12', '2022-01-19', '2022-01-26',
               '2022-02-02', '2022-02-09', '2022-02-16', '2022-02-23',
               '2022-03-02', '2022-03-09', '2022-03-16', '2022-03-23',
               '2022-03-30', '2022-04-06', '2022-04-13', '2022-04-20',
               '2022-04-27', '2022-05-04', '2022-05-11', '2022-05-18',
               '2022-05-25', '2022-06-01', '2022-06-08', '2022-06-15',
               '2022-06-22', '2022-06-29', '2022-07-06', '2022-07-13',
               '2022-07-20', '2022-07-27', '2022-08-03', '2022-08-10',
               '2022-08-17', '2022-08-24', '2022-08-31', '2022-09-07',
               '2022-09-14', '2022-09-21', '2022-09-28', '2022-10-05',
               '2022-10-12', '2022-10-19', '2022-10-26', '2022-11-02',
               '2022-11-09', '2022-11-16', '2022-11-23', '2022-11-30',
               '2022-12-07', '2022-12-14', '2022-12-21', '2022-12-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [50]:
pd.date_range('2021-01-13', periods=12, freq='30d', normalize=True)

DatetimeIndex(['2021-01-13', '2021-02-12', '2021-03-14', '2021-04-13',
               '2021-05-13', '2021-06-12', '2021-07-12', '2021-08-11',
               '2021-09-10', '2021-10-10', '2021-11-09', '2021-12-09'],
              dtype='datetime64[ns]', freq='30D')